Revit 2026 API

# FieldDomainPoints Properties

---

The FieldDomainPoints type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FieldDomainPoints Class

Autodesk.Revit.DB.Analysis Namespace